app/Controllers/Master/DataPenerbit.php

    public function index()
    {
        $data['item'] = [
            'menu'  => 'Data Penerbit',
        ];
        $penerbit = new PenerbitModel();
        $data['datapenerbit'] = $penerbit->paginate(5, 'penerbit');
---
SELECT *
FROM `tb_penerbit`
 LIMIT 20, 5
SELECT COUNT(*) AS `numrows`
FROM `tb_penerbit`

    public function simpan()
    {
        $penerbit = new PenerbitModel();
        $getRule = $penerbit->getRule();
        $penerbit->setValidationRules($getRule);
        $terbit = [
            "nm_penerbit" => $this->request->getPost('nm_penerbit'),
            "kt_penerbit" => $this->request->getPost('kt_penerbit'),
        ];

        if (!$penerbit->insert($terbit)) {
---
INSERT INTO `tb_penerbit` (`nm_penerbit`, `kt_penerbit`) VALUES ('unugiri', 'Bojonegoro')

    public function preview($id)
    {
        $data['item'] = [
            'menu'  => 'Ubah Data Penerbit',
        ];
        $penerbit = new PenerbitModel();
        $data['datapenerbit'] = $penerbit->where('id_penerbit', $id)->first();
---
SELECT *
FROM `tb_penerbit`
WHERE `id_penerbit` = '23'
 LIMIT 1