app/Controllers/Master/KategoriBuku.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $model = new KategoriModel();
        $data['item'] = [
            'model' => $model->findAll(),
            'menu'  => 'Kategori Buku',
        ];