app/Controllers/UsersController.php

SELECT *
FROM `tb_user`
---
    public function index()
    {
        $data['item'] = [
            'menu'  => 'Manajemen User',
        ];
        $user = new UserModel();
        $data['datauser'] = $user->findAll();

SELECT *
FROM `tb_user`
WHERE `id_user` = '4'
 LIMIT 1
---
    public function preview($id)
    {
        $data['item'] = [
            'menu'  => 'Ubah Data User',
        ];
        $user = new UserModel();
        $data['datauser'] = $user->where('id_user', $id)->first();